app/controllers/songs_controller.rb

  def index
    @songs = Song.all
    if Artist.find_by(id: params[:artist_id]) != nil
---
SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @song = Song.find_by(id: params[:id])
    @artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]